---
kind: method
id: M:Autodesk.Revit.Creation.Document.NewFascia(Autodesk.Revit.DB.Architecture.FasciaType,Autodesk.Revit.DB.ReferenceArray)
zh: 文档、文件
source: html/1805a23b-4de5-2f8d-0ceb-4f61256fdf23.htm
---
# Autodesk.Revit.Creation.Document.NewFascia Method

**中文**: 文档、文件

Creates a fascia along a reference array.

## Syntax (C#)
```csharp
public Fascia NewFascia(
	FasciaType FasciaType,
	ReferenceArray references
)
```

## Parameters
- **FasciaType** (`Autodesk.Revit.DB.Architecture.FasciaType`) - The type of the fascia to create
- **references** (`Autodesk.Revit.DB.ReferenceArray`) - An array of planar lines and arcs that represents the place where you
want to place the fascia.

## Returns
If successful a new fascia object within the project, otherwise Nothing nullptr a null reference ( Nothing in Visual Basic) .

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown if the fascia type does not exist in the given document.